/* eslint-disable react/no-unescaped-entities */

interface PolicyConfidentContentProps {
  isMobilePage: boolean;
}

export default function PolicyCookiesContent({
  isMobilePage,
}: PolicyConfidentContentProps) {
  return (
    <>
      <div
        className={`${isMobilePage ? "hidden md:block" : "block"} mt-12 mb-12`}
      >
        <h3>Політика використання куків</h3>
        <p>1. Вступ</p>
        <p>
          Ця Політика використання файлів cookie (далі – "Політика") пояснює, як
          веб-сайт [назва веб-сайту] (далі – "Сайт") використовує файли cookie
          та подібні технології для забезпечення коректної роботи сервісу.
        </p>

        <p>2. Що таке файли cookie?</p>
        <p>
          Файли cookie – це невеликі текстові файли, які зберігаються на
          пристрої користувача під час відвідування Сайту. Вони допомагають:
        </p>
        <ul className="ml-5 list-disc">
          <li>покращити функціональність Сайту;</li>
          <li>запам’ятовувати налаштування користувача;</li>
          <li>полегшувати взаємодію з платформою.</li>
        </ul>

        <p>3. Як ми використовуємо файли cookie?</p>
        <p>Ми застосовуємо файли cookie для наступних цілей:</p>
        <ul className="ml-5 list-disc">
          <li>
            Функціональність сайту: збереження сеансів авторизації, відображення
            збережених товарів у кошику;
          </li>
          <li>
            Безпека: виявлення шахрайських дій та запобігання несанкціонованому
            доступу;
          </li>
          <li>
            Налаштування користувача: запам’ятовування вибраних параметрів,
            таких як мова інтерфейсу.
          </li>
        </ul>

        <p>4. Типи файлів cookie, які ми використовуємо</p>
        <ul className="ml-5 list-disc">
          <li>
            Обов’язкові файли cookie — необхідні для роботи Сайту (авторизація,
            збереження кошика).
          </li>
          <li>
            Файли cookie продуктивності — допомагають аналізувати використання
            Сайту (наприклад, через аналітичні сервіси).
          </li>
          <li>
            Сесійні файли cookie — зберігаються лише під час роботи з сайтом і
            видаляються після закриття браузера.
          </li>
        </ul>

        <p>5. Керування файлами cookie</p>
        <p>
          Користувачі можуть налаштовувати або вимикати файли cookie у
          налаштуваннях свого браузера.
        </p>
        <p>
          Однак варто враховувати, що це може вплинути на роботу деяких функцій
          Сайту — наприклад, на збереження товарів у кошику або можливість входу
          в обліковий запис.
        </p>

        <p>6. Зміни до Політики</p>
        <p>
          Ми можемо періодично оновлювати цю Політику. Актуальна версія завжди
          буде доступна на Сайті.
        </p>

        <p>7. Контактна інформація</p>
        <p>
          Якщо у вас є питання щодо використання файлів cookie, будь ласка,
          звертайтеся за адресою: [email]
        </p>
      </div>
    </>
  );
}
