/* eslint-disable react/no-unescaped-entities */

interface PolicyConfidentContentProps {
  isMobilePage: boolean;
}

export default function UseTermsContent({
  isMobilePage,
}: PolicyConfidentContentProps) {
  return (
    <>
      <div
        className={`${isMobilePage ? "hidden md:block" : "block"} mb-12`}
      >
        <h3>Умови використання</h3>
        <p>1. Загальні положення</p>
        <p>
          Ці Умови використання (далі – "Умови") регулюють порядок використання
          веб-сайту [назва веб-сайту] (далі – "Сайт"). Використовуючи Сайт, ви
          погоджуєтеся з цими Умовами. Якщо ви не згодні, припиніть використання
          Сайту.
        </p>

        <p>2. Реєстрація користувача</p>
        <p>2.1. Доступ до функцій Сайту</p>
        <p>Деякі функції Сайту доступні лише зареєстрованим користувачам.</p>

        <p>2.2. Надання інформації</p>
        <p>
          Користувач зобов’язується надавати правдиву інформацію під час
          реєстрації.
        </p>

        <p>2.3. Конфіденційність</p>
        <p>
          Користувач відповідає за збереження конфіденційності своїх облікових
          даних.
        </p>

        <p>3. Використання Сайту</p>
        <p>3.1. Права користувача</p>
        <p>Користувач має право:</p>
        <ul className="ml-5 list-disc">
          <li>Переглядати товари та здійснювати замовлення;</li>
          <li>Користуватися кошиком для покупок;</li>
          <li>Відстежувати статус своїх замовлень.</li>
        </ul>

        <p>3.2. Заборона на певні дії</p>
        <p>Заборонено:</p>
        <ul className="ml-5 list-disc">
          <li>Використовувати Сайт для незаконних дій;</li>
          <li>
            Втручатися в роботу Сайту або намагатися отримати несанкціонований
            доступ до даних;
          </li>
          <li>Використовувати чужі облікові записи без дозволу.</li>
        </ul>

        <p>4. Обробка персональних даних</p>
        <p>4.1. Політика конфіденційності</p>
        <p>
          Обробка персональних даних здійснюється згідно з [Політикою
          конфіденційності].
        </p>

        <p>4.2. Згода на обробку даних</p>
        <p>
          Використовуючи Сайт, ви погоджуєтесь на збір і обробку своїх
          персональних даних.
        </p>

        <p>5. Відмова від відповідальності</p>
        <p>5.1. Надання Сайту</p>
        <p>Сайт надається "як є" без гарантій безперебійної роботи.</p>

        <p>5.2. Відповідальність</p>
        <p>Ми не несемо відповідальності за:</p>
        <ul className="ml-5 list-disc">
          <li>Помилки або перебої в роботі Сайту;</li>
          <li>Дії третіх осіб, включаючи користувачів;</li>
          <li>Неможливість використання Сайту через технічні проблеми.</li>
        </ul>

        <p>6. Зміни до Умов</p>
        <p>6.1. Оновлення Умов</p>
        <p>
          Ми можемо змінювати ці Умови. Оновлена версія публікується на Сайті.
        </p>

        <p>6.2. Згода з новими Умовами</p>
        <p>
          Продовження використання Сайту після внесення змін означає вашу згоду
          з новими Умовами.
        </p>

        <p>7. Законодавство</p>
        <p>Ці Умови регулюються відповідно до законодавства України.</p>

        <p>8. Контактна інформація</p>
        <p>Якщо у вас є питання, звертайтеся за адресою: [email]</p>
      </div>
    </>
  );
}
