/* eslint-disable react/no-unescaped-entities */

type TabType = "policy-confident" | "policy-cookies" | "use-terms";

type PolicyMobileProps = {
  setActiveTab: (tab: TabType) => void;
  setMobilePage: React.Dispatch<React.SetStateAction<boolean>>;
  isMobilePage: boolean;
};

export default function PolicyMobile({
  setActiveTab,
  setMobilePage,
  isMobilePage,
}: PolicyMobileProps) {
  return (
    <div className="mt-12 mb-12 block md:hidden">
      {isMobilePage && (
        <>
          <div className="relative mb-12 pb-12">
            <h3 className="font-bold">Політика конфіденційності</h3>
            <p>1. Вступ</p>
            <p>
              Ця Політика конфіденційності (далі – "Політика") визначає порядок
              збору, використання та зберігання персональних даних користувачів
              веб-сайту [назва веб-сайту] (далі – "Сайт").
            </p>

            <p>2. Збір персональних даних</p>
            <p>
              2.1. При реєстрації на Сайті користувач може надати такі
              персональні дані:
            </p>
            <ul className="ml-5 list-disc">
              <li>Ім'я (або нікнейм);</li>
              <li>Адреса електронної пошти;</li>
              <li>Пароль (зберігається в зашифрованому вигляді);</li>
              <li>Інші дані, які користувач може надати добровільно.</li>
            </ul>

            <p>2.2. Автоматично збираються такі технічні дані:</p>
            <ul className="ml-5 list-disc">
              <li>IP-адреса;</li>
              <li>Тип браузера та операційна система;</li>
              <li>
                Дані про взаємодію з Сайтом (наприклад, збережені товари,
                історія замовлень).
              </li>
            </ul>

            <p>3. Використання персональних даних</p>
            <p>Персональні дані можуть використовуватися для:</p>
            <ul className="ml-5 list-disc">
              <li>
                Надання доступу до функціоналу Сайту (реєстрація, перегляд
                замовлень, відстеження товарів);
              </li>
              <li>
                Зв'язку з користувачем щодо професійного запису або роботи
                Сайту;
              </li>
              <li>
                Надсилання сервісних повідомлень (наприклад, про зміну статусу
                замовлення);
              </li>
              <li>Покращення роботи Сайту.</li>
            </ul>

            <button
              className="absolute right-0"
              onClick={() => {
                setActiveTab("policy-confident");
                setMobilePage(false);
              }}
            >
              <svg width="34" height="34">
                <use href="/sprite.svg#icon-long-arrow-right"></use>
              </svg>
            </button>
          </div>

          <div className="relative mb-12 pb-12">
            <h3 className="font-bold">Політика використання куків</h3>
            <p>1. Вступ</p>
            <p>
              Ця Політика використання файлів cookie (далі – "Політика")
              пояснює, як веб-сайт [назва веб-сайту] (далі – "Сайт")
              використовує файли cookie та подібні технології для забезпечення
              коректної роботи сервісу.
            </p>

            <p>2. Що таке файли cookie?</p>
            <p>
              Файли cookie – це невеликі текстові файли, які зберігаються на
              пристрої користувача під час відвідування Сайту. Вони допомагають:
            </p>
            <ul>
              <li>покращити функціональність Сайту;</li>
              <li>запам’ятовувати налаштування користувача;</li>
              <li>полегшувати взаємодію з платформою.</li>
            </ul>

            <p>3. Як ми використовуємо файли cookie?</p>
            <p>Ми застосовуємо файли cookie для наступних цілей:</p>
            <ul>
              <li>
                Функціональність сайту: збереження сеансів авторизації,
                відображення збережених товарів у кошику;
              </li>
              <li>
                Безпека: виявлення шахрайських дій та запобігання
                несанкціонованому доступу;
              </li>
              <li>
                Налаштування користувача: запам’ятовування вибраних параметрів,
                таких як мова інтерфейсу.
              </li>
            </ul>

            <p>4. Типи файлів cookie, які ми використовуємо</p>
            <ul>
              <li>
                Обов’язкові файли cookie — необхідні для роботи Сайту
                (авторизація, збереження кошика).
              </li>
              <li>
                Файли cookie продуктивності — допомагають аналізувати
                використання Сайту (наприклад, через аналітичні сервіси).
              </li>
              <li>
                Сесійні файли cookie — зберігаються лише під час роботи з сайтом
                і видаляються після закриття браузера.
              </li>
            </ul>

            <button
              className="absolute right-0"
              onClick={() => {
                setActiveTab("policy-cookies");
                setMobilePage(false);
              }}
            >
              <svg width="34" height="34">
                <use href="/sprite.svg#icon-long-arrow-right"></use>
              </svg>
            </button>
          </div>

          <div className="relative pb-12">
            <h3 className="font-bold">Умови використання</h3>
            <p>1. Загальні положення</p>
            <p>
              Ці Умови використання (далі – "Умови") регулюють порядок
              використання веб-сайту [назва веб-сайту] (далі – "Сайт").
              Використовуючи Сайт, ви погоджуєтеся з цими Умовами. Якщо ви не
              згодні, припиніть використання Сайту.
            </p>

            <p>2. Реєстрація користувача</p>
            <p>2.1. Доступ до функцій Сайту</p>
            <p>
              Деякі функції Сайту доступні лише зареєстрованим користувачам.
            </p>

            <p>2.2. Надання інформації</p>
            <p>
              Користувач зобов’язується надавати правдиву інформацію під час
              реєстрації.
            </p>

            <p>2.3. Конфіденційність</p>
            <p>
              Користувач відповідає за збереження конфіденційності своїх
              облікових даних.
            </p>

            <p>3. Використання Сайту</p>
            <p>3.1. Права користувача</p>
            <p>Користувач має право:</p>
            <ul>
              <li>Переглядати товари та здійснювати замовлення;</li>
              <li>Користуватися кошиком для покупок;</li>
              <li>Відстежувати статус своїх замовлень.</li>
            </ul>

            <p>3.2. Заборона на певні дії</p>
            <p>Заборонено:</p>
            <ul className="ml-5 list-disc">
              <li>Використовувати Сайт для незаконних дій;</li>
              <li>
                Втручатися в роботу Сайту або намагатися отримати
                несанкціонований доступ до даних;
              </li>
              <li>Використовувати чужі облікові записи без дозволу.</li>
            </ul>

            <p>4. Обробка персональних даних</p>
            <p>4.1. Політика конфіденційності</p>
            <p>
              Обробка персональних даних здійснюється згідно з [Політикою
              конфіденційності].
            </p>

            <p>4.2. Згода на обробку даних</p>
            <p>
              Використовуючи Сайт, ви погоджуєтесь на збір і обробку своїх
              персональних даних.
            </p>

            <button
              className="absolute right-0"
              onClick={() => {
                setActiveTab("use-terms");
                setMobilePage(false);
              }}
            >
              <svg width="34" height="34">
                <use href="/sprite.svg#icon-long-arrow-right"></use>
              </svg>
            </button>
          </div>
        </>
      )}
    </div>
  );
}
