import BreadcrumbWidgest from "@/components/widgets/BreadcrumbWidgest";
import Link from "next/link";

export default function ExchangePage() {
	return (
		<>
			<BreadcrumbWidgest text1="Умови обміну та повернення" />
			<section className="px-9 pt-12 lg:px-8 lg:pt-16 xl:px-[120px]">
				<div className="mb-[48px] flex h-[40px] items-center md:hidden">
					<Link href="/">
						<svg aria-label="arrow-left" role="img" height="32" width="32">
							<use href="/icon/sprite.svg#icon-arrow-left"></use>
						</svg>
					</Link>
				</div>

				<h2 className="text-[24px] font-bold lg:text-3xl lg:text-[28px]">
					Умови обміну та повернення
				</h2>

				<div className="mx-auto my-0 mt-12 mb-12 max-w-5xl text-[18px] md:mt-16 md:mb-16">
					<p>
						Якщо з будь-яких причин вас не влаштовує товар, придбаний в
						Card&Board, ви можете повернути або обміняти його протягом 14 днів з
						моменту покупки.
					</p>
					<br />
					<h3>Загальні умови повернення товару:</h3>
					<br />
					<ul>
						<li>
							Товар не повинен мати слідів активної експлуатації, на ньому не
							має бути механічних пошкоджень (подряпин, сколів, потертостей
							тощо);
						</li>{" "}
						<br />
						<li>
							Має бути збережено його упаковку, товарний вигляд, споживчі
							властивості та комплектність (як вказано в інструкції або на
							коробці);
						</li>{" "}
						<br />
						<li>
							При оплаті банківською картою кошти повертаються лише на
							банківську карту;
						</li>{" "}
						<br />
						<li>
							Наявність товарного або касового чека. У разі відсутності чека ми
							постараємося вам допомогти, але залишаємо за собою право попросити
							надати додаткові докази придбання товару у нас (Ст. 9 Закону
							України «Про захист прав споживачів»);
						</li>{" "}
						<br />
					</ul>
					<p>
						Для повернення товару необхідно написати нам на пошту з вказанням
						дати та номеру замовлення. Заявка опрацьовується до трьох робочих
						днів, протягом яких менеджер зв&#39;яжеться з вами для узгодження
						всіх деталей.
					</p>{" "}
					<br />
					<p>
						Повернення можна здійснити Новою Поштою. При поверненні товару датою
						повернення вважається дата відправлення вами посилки. У разі
						відсутності будь-яких виробничих дефектів доставку назад сплачує
						покупець. У разі повернення товару неналежної якості (Ст. 8 Закону
						України «Про захист прав споживачів», ст.1, п.12-13) магазин бере на
						себе витрати за пересилку.
					</p>
				</div>
			</section>
		</>
	);
}
