import {
	Accordion,
	AccordionContent,
	AccordionItem,
	AccordionTrigger,
} from "@/components/ui/accordion";

const faqData = [
	{
		title: "Замовлення та оплата",
		items: [
			{
				question: "Як оформити замовлення на сайті?",
				answer:
					"Щоб оформити замовлення, будь ласка, перейдіть до нашого каталогу, виберіть бажану гру, додайте її до кошика, а потім заповніть форму з вашими контактними даними. Наші менеджери зв'яжуться з вами для підтвердження та уточнення деталей. Ми завжди раді допомогти!",
			},
			{
				question: "Які способи оплати доступні?",
				answer:
					"Наразі ми пропонуємо оплату готівкою при отриманні (для доставки кур'єром або на відділення). Незабаром плануємо додати більше варіантів, тож стежте за оновленнями!",
			},
			{
				question:
					"Чи можу я змінити або скасувати замовлення після оформлення?",
				answer:
					"Так, ви можете змінити або скасувати замовлення, якщо звернетеся до нас до моменту відправлення. Просто зв'яжіться з нашою командою через телефон або email, вказані на сайті, і ми зробимо все можливе, щоб усе владнати швидко та зручно.",
			},
		],
	},
	{
		title: "Доставка та отримання",
		items: [
			{
				question: "Які способи доставки доступні?",
				answer:
					"Ми пропонуємо доставку через Нову Пошту на відділення або кур'єром до дверей. Ви можете обрати зручний для вас варіант під час оформлення замовлення. Наша мета — доставити вашу гру якомога швидше!",
			},
			{
				question: "Скільки часу триває доставка?",
				answer:
					"Тривалість доставки залежить від вашого регіону, але зазвичай це 1-3 робочих дні для міст і до 5 днів для віддалених областей. Ми завжди повідомимо вас про статус замовлення після відправлення.",
			},
			{
				question: "Чи можна самостійно забрати замовлення?",
				answer:
					"Наразі ми надаємо можливість замовити лише з доставкою на відділення Нової Пошти або кур'єром. Самовивіз поки що недоступний, але ми працюємо над розширенням послуг, тож слідкуйте за новинами!",
			},
		],
	},
	{
		title: "Повернення та гарантія",
		items: [
			{
				question: "Чи можна повернути або обміняти товар?",
				answer:
					"Так, ви можете повернути або обміняти товар протягом 14 днів з моменту отримання, якщо він не був у вжитку та збережено оригінальну упаковку. Зверніться до нас для оформлення, і ми допоможемо!",
			},
			{
				question: "Як оформити повернення?",
				answer:
					"Щоб оформити повернення, будь ласка, зв'яжіться з нашою службою підтримки через email або телефон, вказавши номер замовлення та причину. Ми надамо інструкції та координати для відправлення товару назад.",
			},
			{
				question:
					"Що робити, якщо гра прийшла з дефектом або пошкодженою упаковкою?",
				answer:
					"Якщо ваша гра прибула з дефектом або пошкодженою упаковкою, одразу повідомте нас із фото проблеми. Ми організуємо заміну або повернення коштів якомога швидше — ваша задоволеність для нас на першому місці!",
			},
		],
	},
];
export default function QuestionsAndAnswers() {
	return (
		<section className="mb-12 px-9 lg:mb-16 xl:px-[120px]">
			<h3 className="mb-9 text-center text-3xl font-bold">Q&A</h3>
			<Accordion
				type="single"
				collapsible
				className="w-full rounded-lg bg-white p-6"
			>
				{faqData.map((section, index) => (
					<AccordionItem key={index} value={`item-${index}`}>
						<AccordionTrigger className="mb-6 p-0 text-2xl font-bold">
							{section.title}
						</AccordionTrigger>
						<AccordionContent className="p-0 pl-7">
							<Accordion className="p-0" type="single" collapsible>
								{section.items.map((item, subIndex) => (
									<AccordionItem
										className="p-0"
										key={subIndex}
										value={`item-${index}-${subIndex}`}
									>
										<AccordionTrigger className="mb-4 p-0 text-lg font-bold">
											{item.question}
										</AccordionTrigger>
										<AccordionContent className="mb-4 p-0 px-3">
											{item.answer}
										</AccordionContent>
									</AccordionItem>
								))}
							</Accordion>
						</AccordionContent>
					</AccordionItem>
				))}
			</Accordion>
		</section>
	);
}
